acaballero/etherlab/lib/ST77XX-STM32/Display_afb.cpp
#include "Display_afb.h"
#include <string.h>
#include <math.h>
#include <hw/stm32.h>
#include <stdint.h>
#include "Painter.hpp"

#define min2(a, b) ((a) < (b) ? (a) : (b))
#define max2(a, b) ((a) > (b) ? (a) : (b))

/* RGB565 buffer for transferring pixels to the display using DMA */
static const uint16_t b565_buffer_size = DISPLAY_X_PIXELS * 16;

uint16_t b565_buffer[b565_buffer_size];

Display::Display(SPI_HandleTypeDef *spi_port) {
    this->spi_port = spi_port;
    this->curr_buffer = b565_buffer;
}

void Display::convertPalette888to565(const uint32_t *orig, uint16_t *dest, uint8_t size) {
    for (int i = 0; i < size; i++) {
        dest[i] = SWAP_BYTES(RGB888_TO_RGB565(orig[i]));
    }
}

void Display::clear(uint16_t color) {

    if (ow == 0) {
        // We are drawing in the whole area so we can just memset
        memset(this->curr_buffer, color, this->chunk_height * this->curr_area->width * 2);
    } else {
        // The memory of the rectangle is not contiguous in the area
        fillBuffer(color);
    }
}

void Display::setOffset(uint16_t x, uint16_t y, uint16_t w, uint16_t h) {
    ox = x;
    oy = y;
    ow = w;
    oh = h;
}

void Display::clearOffset() {
    ox = 0;
    oy = 0;
    ow = 0;
    oh = 0;
}

void Display::setEnabled(bool b) { this->enabled = b; }

bool Display::getEnabled() { return this->enabled; }

void Display::drawArea(Area *area, Painter *painter) { drawArea(area, painter, true); }

void Display::drawArea(Area *area, Painter *painter, bool pad_display) {

    if (this->enabled) {

        this->drawing = true;

        this->curr_area = area;

        this->gotoXY(0, 0);

        uint16_t x = area->x;
        uint16_t y = area->y;
        if (pad_display) {
            x += DISPLAY_PADDING;
            y += DISPLAY_PADDING;
        }

        setAddressWindow(x, y, x + area->width - 1, y + area->height - 1);

        // Number of pixels in the area
        uint16_t buffer_size_pixels_remaining = area->size;

        // Number of bytes of the block sent to the driver each transfer. This is limited by the memory available

        // We set the buffer size to be a whole number of lines of the area so we can easily determine whether we can write
        // or not, depending on the relative position of the buffer in the area

        // integer floor of buffer_size/2/width
        uint16_t w = area->width;

        uint16_t a = b565_buffer_size / 2;
        uint16_t d = a / w;
        this->chunk_height = d * w == a ? d : d - ((a < 0) ^ (w < 0));

        // chunk_height should not be greater than the area height.
        // An area can be small enough (less than half the buffer size) that it can be drawn in a single DMA transfer
        if (this->chunk_height > area->height) {
            this->chunk_height = area->height;
        }

        uint16_t max_buffer_size = this->chunk_height * w;

        uint16_t dma_buffer_size = buffer_size_pixels_remaining < max_buffer_size ? buffer_size_pixels_remaining : max_buffer_size;

        uint16_t half_dma_buffer_size = max_buffer_size;

        dma_buffer_size *= 2; // we will draw two chunks per DMA transfer

        dma_buffer_size = min2(dma_buffer_size, area->size); // But we won't transfer more than the area size

        uint16_t dma_transfer_length = dma_buffer_size * 2; // 2 bytes per pixel

        if (this->use_dma) {
            InitDisplayDataTransfer();
        } else {
            DISP_DC_PORT->BSRR |= DISP_DC_PIN; // DC PIN SET
        }

        this->current_line = 0;
        // uint16_t dy = area->y;

        this->curr_buffer = b565_buffer;

#if DEBUG_LCD
        char str[10];
        if (area->show_fps) {
            sprintf(str, "%d.%d", (int)area->fps, (int)(area->fps * 10) % 10);
        }
#endif

        while (this->current_line < area->height) {

            this->current_last_line = min2(this->current_line + this->chunk_height, area->height) - 1;

            // Prevent any interruption of the paint callback
            // NVIC_DisableIRQ(TIM8_TRG_COM_TIM14_IRQn); // Disabled, since I'm checking the 'busy' flag from aoutside
            this->busy = true;
            painter->paint_callback();

            // IMPORTANT: The callback must be executed faster than the half transfer of the DMA buffer. Otherwise, the buffer
            // won't be fully written when the DMA transfers it.
            // (This can be a problem if the compilation is set without speed optimizations and, be aware, these
            // optimizations need sometimes to be turned off to be able to properly debug with breakpoints)

#if DEBUG_LCD
            if (area->show_fps) {
                this->writeString(0, curr_area->height - 11, str, (FontDef *)&Font_7x10, C565_BLACK, C565_WHITE);
                this->writeLine(0, curr_area->height - 12, 21, curr_area->height - 12, C565_WHITE);
            }
#endif
            this->busy = false;
            // NVIC_EnableIRQ(TIM8_TRG_COM_TIM14_IRQn);

            this->current_line += this->chunk_height;
            // dy += this->chunk_height;

            if (!this->use_dma) {
                // Transfer the buffer without DMA
                // Experimental: Just to see if I manage to share one SPI bus with two devices, one of which transfers within an interrupt
                for (uint32_t i = 0; i < dma_buffer_size; i++) {

                    // HAL_TIM_Base_Stop_IT(&htim15);
                    DISP_CE_PORT->BSRR |= DISP_CE_PIN << 16;

                    if ((spi_port->Instance->CR1 & SPI_CR1_SPE) != SPI_CR1_SPE) {
                        spi_port->Instance->CR1 |= SPI_CR1_SPE; // enable SPI
                    }
                    *(__IO uint8_t *)&spi_port->Instance->DR =
                        *((__IO uint8_t *)this->curr_buffer + i); // Write data to be transmitted to the SPI data register
                    // while (!(spi_port->Instance->SR & (SPI_SR_TXE)));     // Wait until transmit complete
                    // while (!(spi_port->Instance->SR & (SPI_SR_RXNE)));    // Wait until receive complete
                    while (spi_port->Instance->SR & (SPI_SR_BSY)) {
                        ; // Wait until SPI is not busy anymore
                    }
                    uint8_t rxDat = *(__IO uint8_t *)&spi_port->Instance->DR; // Return received data from SPI data register
                    UNUSED(rxDat);
                    DISP_CE_PORT->BSRR |= DISP_CE_PIN;
                    //  HAL_TIM_Base_Start_IT(&htim15);
                }
            }

